def find_op(a: str) -> str:
    if a == '~':
        return f'{a} - Побітовий оператор Інверсія. Пріорітет: 9'
    if a == '<<':
        return f'{a} - Побітовий здвиг вліво. Пріорітет: 16'
    if a == '>>':
        return f'{a} - Побітовий здвиг вправо. Пріорітет: 16'
    if a == '&':
        return f'{a} - Побітовий оператор І. Пріорітет: 17'
    if a == '^':
        return f'{a} - Побітовий оператор Виключне АБО. Пріорітет: 18'
    if a == '|':
        return f'{a} - Побітовий оператор АБО. Пріорітет: 19'


if __name__ == '__main__':
    symbol = input('Enter symbol: ')
    print(find_op(symbol))
